app/controllers/user_controller.rb

SELECT * FROM `users` WHERE (`users`.`username` = 'admin') AND (users.retired = 0) LIMIT 1
---
  def login
    if request.get?
      reset_session
    else
      user = User.find_by_username params[:user]['username']